z2akhtar-zz/PWC-Demonstrator/AUTOSAR/core/arch/ppc/mpc55xx/drivers/Fls.c
    for (uint32 bank = 0; bank < FLASH_BANK_CNT; bank++) {
        bPtr = &Fls_Global.config->FlsInfo[bank];

        /* In range of bank */
        if( (SourceAddress >= bPtr->sectAddr[0]) &&
            (SourceAddress <= (bPtr->sectAddr[bPtr->sectCnt])) )
        {
            for (uint32 sector = 0; sector < (bPtr->sectCnt + 1); sector++)
            {
                if( SourceAddress == bPtr->sectAddr[sector] ) {
                    rv = E_OK;
                    break;
                }
            }
            break;
        }
    }
    return rv;
}

#if defined(CFG_MPC5777M)
static Std_ReturnType checkValidChunk( Fls_AddressType StartAddress, Fls_AddressType EndAddress ) {
    Std_ReturnType ret = E_NOT_OK;
    const FlashType *bPtr;

    if( StartAddress <= EndAddress ) {
        for (uint32 bank = 0; bank < FLASH_BANK_CNT; bank++) {
            bPtr = &Fls_Global.config->FlsInfo[bank];
            uint32 bankStartAddr = bPtr->sectAddr[0];
            if( (StartAddress >= bankStartAddr) &&
                    (EndAddress < (bankStartAddr + bPtr->bankSize)) ) {
                /* Adresses are within bank. Check if there is an empty sector
                 * between the addresses. */
                ret = E_OK;
                uint32 sector = 0;
                boolean done = FALSE;
                while(!done && (sector < bPtr->sectCnt)) {
                    switch(bPtr->addrSpace[sector]) {
                        case SECTOR_EMPTY:
                            /* Empty sector */
                            if( (((bPtr->sectAddr[sector] <= StartAddress) && (bPtr->sectAddr[sector + 1] > StartAddress)) || /* Start address within the empty sector */
                                    ((bPtr->sectAddr[sector] <= EndAddress) && (bPtr->sectAddr[sector + 1] > EndAddress)) ) || /* End adress within the empty sector */
                                    ((StartAddress < bPtr->sectAddr[sector]) && (bPtr->sectAddr[sector + 1] < EndAddress)) ) {/* Chunk overlaps the complete empty sector */
                                ret = E_NOT_OK;
                                done = TRUE;
                            }
                            break;
                        default:
                            if( (bPtr->sectAddr[sector] <= StartAddress ) &&
                                    (bPtr->sectAddr[sector + 1] > EndAddress) ) {
                                /* Both adresses are within a non-empty dector */
                                ret = E_OK;
                                done = TRUE;
                            }
                            break;
                    }
                    sector++;
                }
                break;
            }
        }
    }
    return ret;
}
#endif

/**
 * Check all bank ranges for a valid address
 *
 * @param SourceAddress
 * @return
 */
static Std_ReturnType checkValidAddress( Fls_AddressType SourceAddress ) {
	Std_ReturnType rv = E_NOT_OK;
    const FlashType *bPtr;

    for (uint32 bank = 0; bank < FLASH_BANK_CNT; bank++) {
        bPtr = &Fls_Global.config->FlsInfo[bank];
        uint32 startAddr = bPtr->sectAddr[0];

		if( (SourceAddress >= startAddr) &&
			(SourceAddress < (startAddr + bPtr->bankSize)) )
		{
			rv = E_OK;
			break;
		}
    }
    return rv;
}

/* @req SWS_Fls_00104 */
static void eraseFail( void ) {
	Fls_Global.jobResultType = MEMIF_JOB_FAILED;
	Fls_Global.jobType = FLS_JOB_NONE;
	Fls_Global.status = MEMIF_IDLE;
#if defined(USE_DEM)
	Dem_ReportErrorStatus(DemConf_DemEventParameter_FLS_E_ERASE_FAILED, DEM_EVENT_STATUS_FAILED);
#endif
	FEE_JOB_ERROR_NOTIFICATION();
}

/* @req SWS_Fls_00105 */
static void writeFail( void ) {
	Fls_Global.jobResultType = MEMIF_JOB_FAILED;
	Fls_Global.jobType = FLS_JOB_NONE;
	Fls_Global.status = MEMIF_IDLE;
#if defined(USE_DEM)
	Dem_ReportErrorStatus(DemConf_DemEventParameter_FLS_E_WRITE_FAILED, DEM_EVENT_STATUS_FAILED);
#endif
	FEE_JOB_ERROR_NOTIFICATION();

}

/* @req SWS_Fls_00106 */
static void readFail( void ) {
	Fls_Global.jobResultType = MEMIF_BLOCK_INCONSISTENT;
	Fls_Global.jobType = FLS_JOB_NONE;
	Fls_Global.status = MEMIF_IDLE;
#if defined(USE_DEM)
	Dem_ReportErrorStatus(DemConf_DemEventParameter_FLS_E_READ_FAILED, DEM_EVENT_STATUS_FAILED);
#endif
	FEE_JOB_ERROR_NOTIFICATION();

}
/* ----------------------------[public functions]----------------------------*/

/**
 *
 * @param ConfigPtr
 */

void Fls_Init(const Fls_ConfigType *ConfigPtr) {
	/** @req SWS_Fls_00014 */
	/** @req SWS_Fls_00086 */
	/** @req SWS_Fls_00015 */
	/** !req SWS_Fls_00048 */
	/** !req SWS_Fls_00325 */
	/** !req SWS_Fls_00326 */

	/** @req SWS_Fls_00268 */
	VALIDATE_NO_RV(Fls_Global.status!=MEMIF_BUSY,FLS_INIT_ID, FLS_E_BUSY );

	VALIDATE_NO_RV((ConfigPtr != NULL), FLS_INIT_ID, FLS_E_PARAM_CONFIG);
	VALIDATE_NO_RV(ConfigPtr->FlsMaxReadFastMode != 0, FLS_INIT_ID, FLS_E_PARAM_CONFIG);
	VALIDATE_NO_RV(ConfigPtr->FlsMaxReadNormalMode != 0, FLS_INIT_ID, FLS_E_PARAM_CONFIG);
	VALIDATE_NO_RV(ConfigPtr->FlsMaxWriteFastMode != 0, FLS_INIT_ID, FLS_E_PARAM_CONFIG);
	VALIDATE_NO_RV(ConfigPtr->FlsMaxWriteNormalMode != 0, FLS_INIT_ID, FLS_E_PARAM_CONFIG);

	Fls_Global.status = MEMIF_UNINIT;
	Fls_Global.jobResultType = MEMIF_JOB_PENDING;

	/** @req SWS_Fls_00191 */
	Fls_Global.config = ConfigPtr;

	Flash_Init();

	/** @req SWS_Fls_00323 */
	/** @req SWS_Fls_00324 */
	Fls_Global.status = MEMIF_IDLE;
	Fls_Global.jobResultType = MEMIF_JOB_OK;
	return;
}

/**
 * Erase flash sectors
 *
 * @param TargetAddress Always from 0 to FLS_TOTAL_SIZE
 * @param Length
 * @return
 */
Std_ReturnType Fls_Erase(Fls_AddressType TargetAddress, Fls_LengthType Length) {
#if FLS_BASE_ADDRESS > 0
	/* Avoid compiler warning */
	TargetAddress += FLS_BASE_ADDRESS;
#endif

	/** @req SWS_Fls_00218  */
	/** @req SWS_Fls_00220 */
	/** @req SWS_Fls_00327 */

	/** @req SWS_Fls_00065 */
	VALIDATE_W_RV( Fls_Global.status != MEMIF_UNINIT, FLS_ERASE_ID, FLS_E_UNINIT, E_NOT_OK );
	/** @req SWS_Fls_00023 */
	VALIDATE_W_RV( Fls_Global.status != MEMIF_BUSY, FLS_ERASE_ID, FLS_E_BUSY, E_NOT_OK );
    /** @req SWS_Fls_00020 */
	VALIDATE_W_RV( E_OK == sectorAligned( TargetAddress ),
	        FLS_ERASE_ID, FLS_E_PARAM_ADDRESS, E_NOT_OK );
    /** @req SWS_Fls_00021  */
    VALIDATE_W_RV( (Length != 0) && (EE_OK == sectorAligned( TargetAddress + Length)),
            FLS_ERASE_ID, FLS_E_PARAM_LENGTH, E_NOT_OK );
#if defined(CFG_MPC5777M)
    VALIDATE_W_RV((E_OK == checkValidChunk(TargetAddress, TargetAddress + Length - 1)), FLS_ERASE_ID, FLS_E_INVALID_AREA, E_NOT_OK);
#endif

	Fls_Global.status = MEMIF_BUSY;				    /** @req SWS_Fls_00328 */
	Fls_Global.jobResultType = MEMIF_JOB_PENDING;   /** @req SWS_Fls_00329 */
	Fls_Global.jobType = FLS_JOB_ERASE;
	Fls_Global.flashAddr = TargetAddress;
	Fls_Global.length = Length;

	LOG_HEX2("Fls_Erase() ",TargetAddress," ", Length);

	/* Unlock */
	Flash_Lock(Fls_Global.config->FlsInfo,FLASH_OP_UNLOCK,TargetAddress, Length );

	/** @req SWS_Fls_00145 */
	if (EE_OK != Flash_Erase(Fls_Global.config->FlsInfo,TargetAddress, Length, NULL )) {
	    return E_NOT_OK;
	}

	return E_OK;	/** @req SWS_Fls_00330 */
}


/**
 * Programs flash sectors
 *
 * @param TargetAddress
 * @param SourceAddressPtr
 * @param Length
 * @return
 */

Std_ReturnType Fls_Write(Fls_AddressType TargetAddress,
		const uint8 *SourceAddressPtr, Fls_LengthType Length) {
#if FLS_BASE_ADDRESS > 0
	/* Avoid compiler warning */
	TargetAddress += FLS_BASE_ADDRESS;
#endif

	/** @req SWS_Fls_00223 */
	/** @req SWS_Fls_00225 */
	/** @req SWS_Fls_00226 */

